In [1]:
#data cleaning
#create a datframe with duplicate rows
import pandas as pd

Duplicate values

In [7]:
df=pd.DataFrame([[10,20],[20,15],[87,66],[10,20]])
df.columns = ['A','B']
df
#note:I created a new dataset smally

    A   B
0  10  20
1  20  15
2  87  66
3  10  20

Remove duplicate rows

In [8]:
df.drop_duplicates()
#note:In the above dataset I removed a duplicate rows by duplicate() i.e the last row is removed

    A   B
0  10  20
1  20  15
2  87  66

Remove duplicate rows based on specific column

In [9]:
#I changed the value of before datset and now its a new dataset 
df=pd.DataFrame([[10,20],[20,15],[87,66],[18,20]])
df.columns = ['A','B']
df

    A   B
0  10  20
1  20  15
2  87  66
3  18  20

In [10]:
#Remove duplicate rows based on specific column from the above dataset
df.drop_duplicates('B')
#NOTE:It removes the duplicate rows based on the specific column 'B'

    A   B
0  10  20
1  20  15
2  87  66